In [59]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("gabrielramos87/an-online-shop-business")

print("Path to dataset files:", path)

Path to dataset files: C:\Users\PC\.cache\kagglehub\datasets\gabrielramos87\an-online-shop-business\versions\7

In [60]:
import pandas as pd
import os

In [61]:
print(os.listdir(path))

['Sales Transaction v.4a.csv']

In [62]:
df = pd.read_csv(f"{path}/Sales Transaction v.4a.csv")
df.head()

,TransactionNo,Date,ProductNo,ProductName,Price,Quantity,CustomerNo,Country
0,581482,12/9/2019,22485,Set Of 2 Wooden Market Crates,21.47,12,17490.0,United Kingdom
1,581475,12/9/2019,22596,Christmas Star Wish List Chalkboard,10.65,36,13069.0,United Kingdom
2,581475,12/9/2019,23235,Storage Tin Vintage Leaf,11.53,12,13069.0,United Kingdom
3,581475,12/9/2019,23272,Tree T-Light Holder Willie Winkie,10.65,12,13069.0,United Kingdom
4,581475,12/9/2019,23239,Set Of 4 Knick Knack Tins Poppies,11.94,6,13069.0,United Kingdom

In [63]:
df.shape

(536350, 8)

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 536350 entries, 0 to 536349
Data columns (total 8 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   TransactionNo  536350 non-null  object
 1   Date           536350 non-null  object
 2   ProductNo      536350 non-null  object
 3   ProductName    536350 non-null  object
 4   Price          536350 non-null  float64
 5   Quantity       536350 non-null  int64
 6   CustomerNo     536295 non-null  float64
 7   Country        536350 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.7+ MB

### Rename

In [65]:
df = df.rename(columns = {"TransactionNo" : "transaction_id"
                          ,"Date": "date"
                          ,"ProductNo": "product_id"
                          ,"ProductName": "name"
                          ,"Price": "price"
                          ,"Quantity": "quantity"
                          ,"CustomerNo": "customer_id"
                          ,"Country": "country"})

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 536350 entries, 0 to 536349
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   transaction_id  536350 non-null  object
 1   date            536350 non-null  object
 2   product_id      536350 non-null  object
 3   name            536350 non-null  object
 4   price           536350 non-null  float64
 5   quantity        536350 non-null  int64
 6   customer_id     536295 non-null  float64
 7   country         536350 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.7+ MB

### Drop duplicate rows

In [67]:
df.drop_duplicates()

,transaction_id,date,product_id,name,price,quantity,customer_id,country
0,581482,12/9/2019,22485,Set Of 2 Wooden Market Crates,21.47,12,17490.0,United Kingdom
1,581475,12/9/2019,22596,Christmas Star Wish List Chalkboard,10.65,36,13069.0,United Kingdom
2,581475,12/9/2019,23235,Storage Tin Vintage Leaf,11.53,12,13069.0,United Kingdom
3,581475,12/9/2019,23272,Tree T-Light Holder Willie Winkie,10.65,12,13069.0,United Kingdom
4,581475,12/9/2019,23239,Set Of 4 Knick Knack Tins Poppies,11.94,6,13069.0,United Kingdom
...,...,...,...,...,...,...,...,...
536345,C536548,12/1/2018,22168,Organiser Wood Antique White,18.96,-2,12472.0,Germany
536346,C536548,12/1/2018,21218,Red Spotty Biscuit Tin,14.09,-3,12472.0,Germany
536347,C536548,12/1/2018,20957,Porcelain Hanging Bell Small,11.74,-1,12472.0,Germany
536348,C536548,12/1/2018,22580,Advent Calendar Gingham Sack,16.35,-4,12472.0,Germany
536349,C536548,12/1/2018,22767,Triple Photo Frame Cornice,20.45,-2,12472.0,Germany

In [68]:
df.isnull().sum()

transaction_id     0
date               0
product_id         0
name               0
price              0
quantity           0
customer_id       55
country            0
dtype: int64

### Drop null customer_id

In [69]:
cusID_null_drop = df.loc[df["customer_id"].isnull()].index

In [70]:
df.drop(cusID_null_drop, inplace=True)

In [71]:
df.shape

(536295, 8)

### Drop cancel order in transaction_id

In [72]:
df.loc[df["transaction_id"].str.contains("C")].shape

(8531, 8)

In [73]:
cancel_order = df.loc[df["transaction_id"].str.contains("C")].index

In [74]:
df.drop(cancel_order, inplace=True)

In [75]:
df.loc[df["quantity"] <= 0].shape

(0, 8)

In [76]:
df.shape

(527764, 8)

### Data Type Casting

In [77]:
df = df.astype({"transaction_id": int, "customer_id" : int})
df["date"] = pd.to_datetime(df["date"], format = "%m/%d/%Y")

In [78]:
df.dtypes

transaction_id             int64
date              datetime64[ns]
product_id                object
name                      object
price                    float64
quantity                   int64
customer_id                int64
country                   object
dtype: object

In [79]:
product_unique = df.loc[~df[["product_id", "name", "price"]].duplicated()] 
# keep only the first occurrence of each unique combination

In [80]:
product_unique.sort_values(by=["name","date"]).head(10)

,transaction_id,date,product_id,name,price,quantity,customer_id,country
507047,538877,2018-12-14,22418,10 Colour Spaceboy Pen,12.82,2,14877,United Kingdom
491632,540154,2019-01-05,22418,10 Colour Spaceboy Pen,11.95,2,12154,United Kingdom
130922,572035,2019-10-20,22418,10 Colour Spaceboy Pen,10.99,144,14646,Netherlands
94877,574856,2019-11-07,22418,10 Colour Spaceboy Pen,12.77,2,17856,United Kingdom
52165,578067,2019-11-22,22418,10 Colour Spaceboy Pen,11.92,1,12067,United Kingdom
52626,578069,2019-11-22,22418,10 Colour Spaceboy Pen,11.12,48,14329,United Kingdom
12834,580610,2019-12-05,22418,10 Colour Spaceboy Pen,6.13,1,12610,United Kingdom
13333,580612,2019-12-05,22418,10 Colour Spaceboy Pen,7.24,1,13612,United Kingdom
619,581492,2019-12-09,22418,10 Colour Spaceboy Pen,6.19,3,15492,United Kingdom
498226,539631,2018-12-20,22436,12 Coloured Party Balloons,11.56,1,14631,United Kingdom

### Product price fluctuation

In [81]:
df[["date","product_id","name","price"]].sort_values(by=["name","date"]).head(10)

             date product_id                    name  price
533683 2018-12-01      22418  10 Colour Spaceboy Pen  11.12
534531 2018-12-01      22418  10 Colour Spaceboy Pen  11.12
534759 2018-12-01      22418  10 Colour Spaceboy Pen  11.95
535239 2018-12-01      22418  10 Colour Spaceboy Pen  11.12
531338 2018-12-02      22418  10 Colour Spaceboy Pen  11.12
531736 2018-12-02      22418  10 Colour Spaceboy Pen  11.12
532215 2018-12-02      22418  10 Colour Spaceboy Pen  11.12
533072 2018-12-02      22418  10 Colour Spaceboy Pen  11.12
529565 2018-12-03      22418  10 Colour Spaceboy Pen  11.95
530505 2018-12-03      22418  10 Colour Spaceboy Pen  12.82

In [82]:
df = df.groupby(["transaction_id", "date", "product_id", "name", "price","customer_id","country"])["quantity"].sum().reset_index()

In [83]:
df.loc[
    (df["transaction_id"] == 579171) &
    (df["product_id"] == "22897")
]
# checking if the groupby function is working correctly or not

,transaction_id,date,product_id,name,price,customer_id,country,quantity
484529,579171,2019-11-28,22897,Oven Mitt Apples Design,6.19,13030,United Kingdom,6

In [84]:
df.shape

(517897, 8)

In [85]:
df["year"] = df['date'].dt.year
df["quarter"] = df['date'].dt.quarter
df["month"] = df['date'].dt.month
df["week"] = df['date'].dt.isocalendar().week
df["day"] = df['date'].dt.day
df["day_name"] = df['date'].dt.day_name()

In [86]:
country_id = df["country"].str.upper().str.slice(stop=3) + df["country"].str.len().astype(str)
df["country_id"] = country_id

In [87]:
df.dtypes

transaction_id             int64
date              datetime64[ns]
product_id                object
name                      object
price                    float64
customer_id                int64
country                   object
quantity                   int64
year                       int32
quarter                    int32
month                      int32
week                      UInt32
day                        int32
day_name                  object
country_id                object
dtype: object

In [88]:
df.shape

(517897, 15)

### Load Process

In [89]:
from sqlalchemy import create_engine, text
engine = create_engine("postgresql://postgres:mysecret@localhost:5432/postgres")
engine.connect()

In [90]:
df_customer = df[["customer_id"]].drop_duplicates().sort_values(by="customer_id")
df_customer = df_customer.reset_index(drop=True)
df_customer["customer_key"] = df_customer.index
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4718 entries, 0 to 4717
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   4718 non-null   int64
 1   customer_key  4718 non-null   int64
dtypes: int64(2)
memory usage: 73.8 KB

In [91]:
df_transaction = df[["transaction_id"]].drop_duplicates().sort_values(by="transaction_id")
df_transaction = df_transaction.reset_index(drop=True)
df_transaction["transaction_key"] = df_transaction.index
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19789 entries, 0 to 19788
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transaction_id   19789 non-null  int64
 1   transaction_key  19789 non-null  int64
dtypes: int64(2)
memory usage: 309.3 KB

In [92]:
df_date = df[["date", "year", "quarter", "month", "week", "day", "day_name"]].drop_duplicates().sort_values(by="date")
df_date = df_date.reset_index(drop=True)
df_date["date_key"] = df_date.index
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 305 entries, 0 to 304
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      305 non-null    datetime64[ns]
 1   year      305 non-null    int32
 2   quarter   305 non-null    int32
 3   month     305 non-null    int32
 4   week      305 non-null    UInt32
 5   day       305 non-null    int32
 6   day_name  305 non-null    object
 7   date_key  305 non-null    int64
dtypes: UInt32(1), datetime64[ns](1), int32(4), int64(1), object(1)
memory usage: 13.5+ KB

In [93]:
df_country = df[["country", "country_id"] ].drop_duplicates().sort_values(by="country_id")
df_country = df_country.reset_index(drop=True)
df_country["country_key"] = df_country.index
df_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      38 non-null     object
 1   country_id   38 non-null     object
 2   country_key  38 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.0+ KB

In [94]:
df_product = df[['product_id', "name", "price"]]
unique_product = df_product.drop_duplicates().sort_values(by=["name", "price"])
unique_product = unique_product.reset_index(drop=True)
unique_product["product_key"] = unique_product.index

df_unique_product = pd.merge(df_product, unique_product, on=["product_id", "name", "price"]).sort_values(by=["name", "price"]).drop_duplicates()
df_unique_product.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23498 entries, 472729 to 185296
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product_id   23498 non-null  object
 1   name         23498 non-null  object
 2   price        23498 non-null  float64
 3   product_key  23498 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 917.9+ KB

### Join all to fact table

In [95]:
result = pd.merge(df, df_customer, on="customer_id")
result = pd.merge(result, df_transaction, on="transaction_id")
result = pd.merge(result, df_date, on=["date", "year", "quarter", "month", "week", "day", "day_name"])
result = pd.merge(result,df_country, on=["country_id", "country"])
result = pd.merge(result, df_unique_product, on=["product_id", "name", "price"])

In [96]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517897 entries, 0 to 517896
Data columns (total 20 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   transaction_id   517897 non-null  int64
 1   date             517897 non-null  datetime64[ns]
 2   product_id       517897 non-null  object
 3   name             517897 non-null  object
 4   price            517897 non-null  float64
 5   customer_id      517897 non-null  int64
 6   country          517897 non-null  object
 7   quantity         517897 non-null  int64
 8   year             517897 non-null  int32
 9   quarter          517897 non-null  int32
 10  month            517897 non-null  int32
 11  week             517897 non-null  UInt32
 12  day              517897 non-null  int32
 13  day_name         517897 non-null  object
 14  country_id       517897 non-null  object
 15  customer_key     517897 non-null  int64
 16  transaction_key  517897 non-null  int64
 17  date_key         517897 non-null  int64
 18  country_key      517897 non-null  int64
 19  product_key      517897 non-null  int64
dtypes: UInt32(1), datetime64[ns](1), float64(1), int32(4), int64(8), object(5)
memory usage: 69.6+ MB

In [97]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4718 entries, 0 to 4717
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   4718 non-null   int64
 1   customer_key  4718 non-null   int64
dtypes: int64(2)
memory usage: 73.8 KB

In [98]:
df_customer_dim = df_customer.set_index("customer_key")
df_customer_dim.to_sql("customer_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE customer_dim ADD PRIMARY KEY (customer_key);"))
df_customer_dim.shape

(4718, 1)

In [99]:
df_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19789 entries, 0 to 19788
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transaction_id   19789 non-null  int64
 1   transaction_key  19789 non-null  int64
dtypes: int64(2)
memory usage: 309.3 KB

In [100]:
df_transaction_dim = df_transaction.set_index("transaction_key")
df_transaction_dim.to_sql("transaction_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE transaction_dim ADD PRIMARY KEY (transaction_key);"))
df_transaction_dim.shape

(19789, 1)

In [101]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 305 entries, 0 to 304
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      305 non-null    datetime64[ns]
 1   year      305 non-null    int32
 2   quarter   305 non-null    int32
 3   month     305 non-null    int32
 4   week      305 non-null    UInt32
 5   day       305 non-null    int32
 6   day_name  305 non-null    object
 7   date_key  305 non-null    int64
dtypes: UInt32(1), datetime64[ns](1), int32(4), int64(1), object(1)
memory usage: 13.5+ KB

In [102]:
df_date_dim = df_date.set_index("date_key")
df_date_dim['date'] = df_date_dim['date'].dt.date
df_date_dim.to_sql("date_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE date_dim ADD PRIMARY KEY (date_key);"))
df_date_dim.shape

(305, 7)

In [103]:
df_unique_product.info()

<class 'pandas.core.frame.DataFrame'>
Index: 23498 entries, 472729 to 185296
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   product_id   23498 non-null  object
 1   name         23498 non-null  object
 2   price        23498 non-null  float64
 3   product_key  23498 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 917.9+ KB

In [104]:
df_product_dim = df_unique_product.set_index("product_key")
df_product_dim.to_sql("product_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE product_dim ADD PRIMARY KEY (product_key);"))
df_product_dim.shape

(23498, 3)

In [105]:
df_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      38 non-null     object
 1   country_id   38 non-null     object
 2   country_key  38 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.0+ KB

In [106]:
df_country_dim = df_country.set_index("country_key")
df_country_dim.to_sql("country_dim", con=engine, if_exists="replace")
with engine.connect() as conn:
    conn.execute(text("ALTER TABLE country_dim ADD PRIMARY KEY (country_key);"))
df_country_dim.shape

(38, 2)

In [107]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 517897 entries, 0 to 517896
Data columns (total 20 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   transaction_id   517897 non-null  int64
 1   date             517897 non-null  datetime64[ns]
 2   product_id       517897 non-null  object
 3   name             517897 non-null  object
 4   price            517897 non-null  float64
 5   customer_id      517897 non-null  int64
 6   country          517897 non-null  object
 7   quantity         517897 non-null  int64
 8   year             517897 non-null  int32
 9   quarter          517897 non-null  int32
 10  month            517897 non-null  int32
 11  week             517897 non-null  UInt32
 12  day              517897 non-null  int32
 13  day_name         517897 non-null  object
 14  country_id       517897 non-null  object
 15  customer_key     517897 non-null  int64
 16  transaction_key  517897 non-null  int64
 17  date_key         517897 non-null  int64
 18  country_key      517897 non-null  int64
 19  product_key      517897 non-null  int64
dtypes: UInt32(1), datetime64[ns](1), float64(1), int32(4), int64(8), object(5)
memory usage: 69.6+ MB

In [108]:
df_sales_fact = result[["customer_key", "transaction_key", "date_key", "product_key", "country_key", "quantity"]].sort_values(by="date_key")
df_sales_fact.to_sql("sales_fact", con=engine, if_exists="replace", index=False)

897

In [109]:
df_sales_fact.loc[
    df_sales_fact["transaction_key"] == 17238
]

,customer_key,transaction_key,date_key,product_key,country_key,quantity
441025,1340,17238,281,6360,34,2
441026,1340,17238,281,6376,34,1
441037,1340,17238,281,12985,34,1
441038,1340,17238,281,2145,34,4
441039,1340,17238,281,23362,34,1
...,...,...,...,...,...,...
441210,1340,17238,281,18472,34,1
441219,1340,17238,281,21039,34,6
441220,1340,17238,281,17426,34,4
441225,1340,17238,281,8893,34,1
441226,1340,17238,281,19124,34,1

In [110]:
result.loc[
    (result["customer_key"] == 1340) & 
    (result["product_key"] == 10380)
]

,transaction_id,date,product_id,name,price,customer_id,country,quantity,year,quarter,month,week,day,day_name,country_id,customer_key,transaction_key,date_key,country_key,product_key
441027,575947,2019-11-13,20711,Jumbo Bag Toys,7.24,13947,United Kingdom,5,2019,4,11,46,13,Wednesday,UNI14,1340,17238,281,34,10380

### Checking if both .csv from notebook and .py are the same or not

In [111]:
df_sample = df.head(100).sort_values(by=["transaction_id", "product_id"])

In [112]:
df_sample.to_csv("notebook_output.csv", index=False)

In [116]:
import pandas as pd

notebook_df = pd.read_csv("notebook_output.csv")
script_df = pd.read_csv("../etl/script_output.csv")

# Check equality
print(notebook_df.equals(script_df))  # True means they match

False

In [117]:
print("Notebook shape:", notebook_df.shape)
print("Script shape:", script_df.shape)

Notebook shape: (100, 15)
Script shape: (100, 15)

In [118]:
print("Notebook columns:", notebook_df.columns.tolist())
print("Script columns:", script_df.columns.tolist())

Notebook columns: ['transaction_id', 'date', 'product_id', 'name', 'price', 'customer_id', 'country', 'quantity', 'year', 'quarter', 'month', 'week', 'day', 'day_name', 'country_id']
Script columns: ['transaction_id', 'date', 'product_id', 'name', 'price', 'customer_id', 'country', 'country_id', 'quantity', 'year', 'quarter', 'month', 'week', 'day', 'day_name']

In [ ]:
notebook_df_sorted = notebook_df.sort_values(by=notebook_df.columns.tolist()).reset_index(drop=True)
script_df_sorted = script_df.sort_values(by=script_df.columns.tolist()).reset_index(drop=True)

In [121]:
# Step 1: Sort column names alphabetically
notebook_df_sorted = notebook_df[sorted(notebook_df.columns)]
script_df_sorted = script_df[sorted(script_df.columns)]

# Step 2: Sort rows (ensure same row order)
notebook_df_sorted = notebook_df_sorted.sort_values(by=notebook_df_sorted.columns.tolist()).reset_index(drop=True)
script_df_sorted = script_df_sorted.sort_values(by=script_df_sorted.columns.tolist()).reset_index(drop=True)

# Step 3: Now safe to compare
diff = notebook_df_sorted.compare(script_df_sorted)
print(diff)

Empty DataFrame
Columns: []
Index: []